tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "warrensbox/tap"

# Fonts
tap "homebrew/cask-fonts"
cask "font-inconsolata-nerd-font"
cask "font-hack"


# Essentials
brew "automake"
brew "autojump"
brew "coreutils"
brew "htop"
brew "gnupg", link: false
brew "grep"
brew "iproute2mac"
brew "jq"
brew "libyaml"
brew "nmap"
brew "neovim"
brew "pidof"
brew "pinentry-mac"
brew "pstree"
brew "ripgrep"
brew "tree"
brew "watch"
brew "wget"
brew "yq"

# Apps
cask "discord"
cask "docker"
cask "spotify"
cask "slack"
cask "visual-studio-code"

# Python
brew "virtualenv"

# Zsh
brew "zsh"
brew "zsh-completions"

# Git
brew "gh"

# Kubernetes
brew "kubectl"
brew "kubectx"
brew "k9s"
brew "kubernetes-cli"
brew "helm"
brew "stern"

# Aws
tap "aws/tap"
brew "awscli", link: false
brew "aws/tap/aws-sam-cli"
brew "s3cmd"

# Terraform
brew "tfenv"
brew "warrensbox/tap/tfswitch"

# Security
cask "1password-cli"
